      * DECK STORAGE -- 52 CARD STANDARD DECK W/ JOKERS REMOVED 1977
      * UPDATED 03/82 FOR NEW SHUFFLING ALGORITHM
       01 WS-DK.
          05 WS-CT1          PIC 99.
          05 WS-CDS OCCURS 52 TIMES.
             10 WS-S1        PIC X.
             10 WS-RK        PIC XX.
             10 WS-FV        PIC 99.
