       IDENTIFICATION DIVISION.
       PROGRAM-ID. MACRO-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 WS-AMT PIC 9(5).
           77 WS-RATE PIC 9(3).
       PROCEDURE DIVISION.
       MAIN-PARA.
           CALL 'DLTM-ACCT-LOCK' USING WS-AMT.
           MOVE DLTM-RATE-VAL TO WS-RATE.
           STOP RUN.
